In [1]:
import pandas as pd

In [2]:
data = {
    "Nombre": ["Rosa", "Santiago", "Gisel", "Roberto"],
    "Edad": [25,12,35,94],
    "Cuidad": ["Tampa", "Chicago", "New York", "San Diego"]
}

df = pd.DataFrame(data)

In [3]:
df

     Nombre  Edad     Cuidad
0      Rosa    25      Tampa
1  Santiago    12    Chicago
2     Gisel    35   New York
3   Roberto    94  San Diego

In [4]:
df["Salario"] = [2000,35000,45000,80000]
df

     Nombre  Edad     Cuidad  Salario
0      Rosa    25      Tampa     2000
1  Santiago    12    Chicago    35000
2     Gisel    35   New York    45000
3   Roberto    94  San Diego    80000

In [5]:
df["Salario"] = df["Salario"] + 2000
df

     Nombre  Edad     Cuidad  Salario
0      Rosa    25      Tampa     4000
1  Santiago    12    Chicago    37000
2     Gisel    35   New York    47000
3   Roberto    94  San Diego    82000

Select specific column to apply filters on Series and filtering with conditionals

In [6]:
nombres = df["Nombre"]
nombres

0        Rosa
1    Santiago
2       Gisel
3     Roberto
Name: Nombre, dtype: object

In [7]:
age_over_25 = df[df["Edad"] > 25]
age_over_25

    Nombre  Edad     Cuidad  Salario
2    Gisel    35   New York    47000
3  Roberto    94  San Diego    82000

In [8]:
libros_df = {"Titulo": ["El Quijote", "Cien años de soledad", "La odisea"], "Autor": ["Miguel de Cervantes", "Gabriel García Márquez", "Homero"], "Año": [1605,1967,-800]}
df = pd.DataFrame(libros_df)
df

                 Titulo                   Autor   Año
0            El Quijote     Miguel de Cervantes  1605
1  Cien años de soledad  Gabriel García Márquez  1967
2             La odisea                  Homero  -800

In [9]:
datos_libros = {
    "Titulo": ["El Quijote", "Cien años de soledad", "La odisea"],
    "Autor": ["Miguel de Cervantes", "Gabriel García Márquez", "Homero"],
    "Año": [1605, 1967, -800]
}
libros_df = pd.DataFrame(datos_libros)
libros_df

                 Titulo                   Autor   Año
0            El Quijote     Miguel de Cervantes  1605
1  Cien años de soledad  Gabriel García Márquez  1967
2             La odisea                  Homero  -800

In [10]:
# Datos proporcionados
data_personas = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}
 
# Creación del DataFrame
df = pd.DataFrame(data_personas)
 
# Filtrado de las filas para personas de 25 años o más
df_filtrado = df[df['Edad'] >= 25]
df_filtrado

  Nombre  Edad     Ciudad
0    Ana    25     Madrid
1   Luis    30  Barcelona
3   Sara    27     Bilbao

In [11]:
# Datos originales proporcionados
data_modificacion = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}
 
# Creando el DataFrame
df = pd.DataFrame(data_modificacion)
 
# Agregando la columna Edad_en_10_años
df['Edad_en_10_años'] = df['Edad'] + 10
 
# Modificando la columna Ciudad para que esté en mayúsculas
df['Ciudad'] = df['Ciudad'].str.upper()
 
# Creando la columna Es_Mayor_de_25
df['Es_Mayor_de_25'] = df['Edad'] >= 25
df

   Nombre  Edad     Ciudad  Edad_en_10_años  Es_Mayor_de_25
0     Ana    25     MADRID               35            True
1    Luis    30  BARCELONA               40            True
2  Carlos    22   VALENCIA               32           False
3    Sara    27     BILBAO               37            True